tps/table_num_delay_6.txt
Script started on 2026-02-20 16:07:26+09:00 [TERM="tmux-256color" TTY="/dev/pts/2" COLUMNS="229" LINES="65"]
1024
🦊 ~/mysql_test/tps @ann🦁 
$> =eecho 'compasre    are the number of tables[1,2,5,10]; '>
kecho\compare the number of tables[1,2,5,10]
🐺 ~/mysql_test/tps @ann🦔 
$> =eecho 'innodb_spin_wait_pause_multiplier:5, innodb_sync_spin_loops:10innodb_spin_wait_pause_multiplier:5, innodb_sync_spin_loops:10'innodb_spin_wait_delayinnodb_spin_wait_pause_multiplier:5, innodb_sync_spin_loops:10'delay:innodb_spin_wait_pause_multiplier:5, innodb_sync_spin_loops:10'6innodb_spin_wait_pause_multiplier:5, innodb_sync_spin_loops:10',innodb_spin_wait_pause_multiplier:5, innodb_sync_spin_loops:10'pin_wait_pause_multiplier:5, innodb_sync_spin_loops:10'>
kecho\innodb_spin_wait_delay:6, innodb_spin_wait_pause_multiplier:5, innodb_sync_spin_loops:10
🦔 ~/mysql_test/tps @ann🦈 
$> =eecho 'table     use 1 table'>
kecho\use 1 table
🐯 ~/mysql_test/tps @ann🦈 
$> =ttaskset -c 1-7,9-15 sysbench oltp_read_write \
    --mysql-host=127.0.0.1 \
    --mysql-port=3306 \
    --mysql-user=root \
    --mysql-password=password \
    --mysql-db=sbtest \
    --tables=1 \
    --table_size=100000 \
    --threads=32 \
    --time=60 \
    --rand-type=pareto \
    run>
ktaskset\sysbench 1.0.20 (using system LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 32
Initializing random number generator from current time


Initializing worker threads...

Threads started!

SQL statistics:
    queries performed:
        read:                            374206
        write:                           106427
        other:                           53269
        total:                           533902
    transactions:                        26540  (442.01 per sec.)
    queries:                             533902 (8891.90 per sec.)
    ignored errors:                      189    (3.15 per sec.)
    reconnects:                          0      (0.00 per sec.)

General statistics:
    total time:                          60.0416s
    total number of events:              26540

Latency (ms):
         min:                                    5.28
         avg:                                   72.36
         max:                                  318.31
         95th percentile:                      147.61
         sum:                              1920565.83

Threads fairness:
    events (avg/stddev):           829.3750/20.74
    execution time (avg/stddev):   60.0177/0.01

🐒 ~/mysql_test/tps @ann🐒 
$> =eecho 'use 1 table' table' 2 table'>
kecho\use 2 table
🐢 ~/mysql_test/tps @ann🐒 
$> =ttaskset -c 1-7,9-15 sysbench oltp_read_write \
    --mysql-host=127.0.0.1 \
    --mysql-port=3306 \
    --mysql-user=root \
    --mysql-password=password \
    --mysql-db=sbtest \
    --tables=1 \
    --table_size=100000 \
    --threads=32 \
    --time=60 \
    --rand-type=pareto \
MM \ 2 \>
ktaskset\sysbench 1.0.20 (using system LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 32
Initializing random number generator from current time


Initializing worker threads...

Threads started!

SQL statistics:
    queries performed:
        read:                            383390
        write:                           109068
        other:                           54589
        total:                           547047
    transactions:                        27204  (453.05 per sec.)
    queries:                             547047 (9110.46 per sec.)
    ignored errors:                      181    (3.01 per sec.)
    reconnects:                          0      (0.00 per sec.)

General statistics:
    total time:                          60.0438s
    total number of events:              27204

Latency (ms):
         min:                                    6.86
         avg:                                   70.60
         max:                                  380.46
         95th percentile:                      167.44
         sum:                              1920641.70

Threads fairness:
    events (avg/stddev):           850.1250/19.90
    execution time (avg/stddev):   60.0201/0.01

🐶 ~/mysql_test/tps @ann🐬 
$> =eecho 'use 5 table'>
kecho\use 5 table
🐯 ~/mysql_test/tps @ann🦔 
$> =ttaskset -c 1-7,9-15 sysbench oltp_read_write \
    --mysql-host=127.0.0.1 \
    --mysql-port=3306 \
    --mysql-user=root \
    --mysql-password=password \
    --mysql-db=sbtest \
    --tables=2 \
    --table_size=100000 \
    --threads=32 \
    --time=60 \
    --rand-type=pareto \
MMM \ 5 \>
ktaskset\sysbench 1.0.20 (using system LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 32
Initializing random number generator from current time


Initializing worker threads...

Threads started!

SQL statistics:
    queries performed:
        read:                            378084
        write:                           107884
        other:                           53955
        total:                           539923
    transactions:                        26949  (448.62 per sec.)
    queries:                             539923 (8988.07 per sec.)
    ignored errors:                      57     (0.95 per sec.)
    reconnects:                          0      (0.00 per sec.)

General statistics:
    total time:                          60.0686s
    total number of events:              26949

Latency (ms):
         min:                                   19.80
         avg:                                   71.29
         max:                                  226.30
         95th percentile:                      112.67
         sum:                              1921170.65

Threads fairness:
    events (avg/stddev):           842.1562/7.20
    execution time (avg/stddev):   60.0366/0.02

🐢 ~/mysql_test/tps @ann🐬 
$> =eecho 'use 10 table'>
kecho\use 10 table
🦉 ~/mysql_test/tps @ann🐢 
$> =ttaskset -c 1-7,9-15 sysbench oltp_read_write \
    --mysql-host=127.0.0.1 \
    --mysql-port=3306 \
    --mysql-user=root \
    --mysql-password=password \
    --mysql-db=sbtest \
    --tables=5 \
    --table_size=100000 \
    --threads=32 \
    --time=60 \
    --rand-type=pareto \
 \ 1 \0 \>
ktaskset\sysbench 1.0.20 (using system LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 32
Initializing random number generator from current time


Initializing worker threads...

Threads started!

SQL statistics:
    queries performed:
        read:                            362516
        write:                           103542
        other:                           51775
        total:                           517833
    transactions:                        25881  (430.86 per sec.)
    queries:                             517833 (8620.82 per sec.)
    ignored errors:                      13     (0.22 per sec.)
    reconnects:                          0      (0.00 per sec.)

General statistics:
    total time:                          60.0653s
    total number of events:              25881

Latency (ms):
         min:                                   14.78
         avg:                                   74.23
         max:                                  186.81
         95th percentile:                       94.10
         sum:                              1921168.36

Threads fairness:
    events (avg/stddev):           808.7812/4.18
    execution time (avg/stddev):   60.0365/0.02

🐪 ~/mysql_test/tps @ann🐺 
$> =eexit>
kexit\
Script done on 2026-02-20 16:24:18+09:00 [COMMAND_EXIT_CODE="0"]